{"status": "ok", "data": {"movies": [{"rating": 8.6, "genres": ["Crime", "Drama"], "language": "English", "title": "Leon: The Professional", "url": "https://yts.to/movie/leon-the-professional-1994", "title_long": "Leon: The Professional (1994)", "imdb_code": "tt0110413", "id": 785, "state": "ok", "year": 1994, "runtime": 110, "overview": "Leon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Leon's footsteps.", "slug": "leon-the-professional-1994", "mpa_rating": "Unrated"}, {"rating": 8.6, "genres": ["Crime", "Drama"], "language": "English", "title": "American History X", "url": "https://yts.to/movie/american-history-x-1998", "title_long": "American History X (1998)", "imdb_code": "tt0120586", "id": 988, "state": "ok", "year": 1998, "runtime": 119, "overview": "Derek Vineyard is paroled after serving 3 years in prison for killing two thugs who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.", "slug": "american-history-x-1998", "mpa_rating": "R"}, {"rating": 8.6, "genres": ["Drama", "Thriller"], "language": "English", "title": "The Silence of the Lambs", "url": "https://yts.to/movie/the-silence-of-the-lambs-1991", "title_long": "The Silence of the Lambs (1991)", "imdb_code": "tt0102926", "id": 1071, "state": "ok", "year": 1991, "runtime": 118, "overview": "FBI trainee Clarice Starling ventures into a maximum-security asylum to pick the diseased brain of Hannibal Lecter, a psychiatrist turned homicidal cannibal. Starling needs clues to help her capture a serial killer. Unfortunately, her Faustian relationship with Lecter soon leads to his escape, and now two deranged killers are on the loose.", "slug": "the-silence-of-the-lambs-1991", "mpa_rating": "R"}, {"rating": 8.6, "genres": ["Western"], "language": "English", "title": "Once Upon a Time in the West", "url": "https://yts.to/movie/once-upon-a-time-in-the-west-1968", "title_long": "Once Upon a Time in the West (1968)", "imdb_code": "tt0064116", "id": 1956, "state": "ok", "year": 1968, "runtime": 175, "overview": "This classic western masterpiece is an epic film about a widow whose land and life are in danger as the railroad is getting closer and closer to taking them over. A mysterious harmonica player joins forces with a desperado to protect the woman and her land.", "slug": "once-upon-a-time-in-the-west-1968", "mpa_rating": "M"}, {"rating": 8.5, "genres": ["Action", "Drama"], "language": "English", "title": "Gladiator", "url": "https://yts.to/movie/gladiator-2000", "title_long": "Gladiator (2000)", "imdb_code": "tt0172495", "id": 408, "state": "ok", "year": 2000, "runtime": 155, "overview": "Gladiator is an epic film of love, death and betrayal set in the Roman Empire. General Maximus' success in battle earns the favour of an elderly Emperor at the expense of the Emperor's son. In a fit of jealous rage the son slays his father before turning his anger towards Maximus. Now reduced to a slave, his family dead, Maximus must fight as a gladiator to gain his freedom, and his revenge.", "slug": "gladiator-2000", "mpa_rating": "R"}, {"rating": 8.5, "genres": ["Horror", "Sci-Fi"], "language": "English", "title": "Alien", "url": "https://yts.to/movie/alien-1979", "title_long": "Alien (1979)", "imdb_code": "tt0078748", "id": 484, "state": "ok", "year": 1979, "runtime": 117, "overview": "During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew discovers a chamber containing thousands of eggs on the planet, a creature inside one of the eggs attacks an explorer. The entire crew is unaware of the impending nightmare set to descend upon them when the alien parasite planted inside its unfortunate host is birthed.", "slug": "alien-1979", "mpa_rating": "TV-14"}, {"rating": 8.5, "genres": ["Crime", "Drama"], "language": "English", "title": "The Green Mile", "url": "https://yts.to/movie/the-green-mile-1999", "title_long": "The Green Mile (1999)", "imdb_code": "tt0120689", "id": 953, "state": "ok", "year": 1999, "runtime": 189, "overview": "A supernatural tale set on death row in a Southern prison, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. When the cellblock's head guard, Paul Edgecomb, recognizes Coffey's miraculous gift, he tries desperately to help stave off the condemned man's execution.", "slug": "the-green-mile-1999", "mpa_rating": "R"}, {"rating": 8.5, "genres": ["Action", "Thriller"], "language": "English", "title": "The Dark Knight Rises", "url": "https://yts.to/movie/the-dark-knight-rises-2012", "title_long": "The Dark Knight Rises (2012)", "imdb_code": "tt1345836", "id": 1421, "state": "ok", "year": 2012, "runtime": 165, "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.", "slug": "the-dark-knight-rises-2012", "mpa_rating": "PG-13"}, {"rating": 8.5, "genres": ["Western"], "language": "English", "title": "Django Unchained", "url": "https://yts.to/movie/django-unchained-2012", "title_long": "Django Unchained (2012)", "imdb_code": "tt1853728", "id": 1832, "state": "ok", "year": 2012, "runtime": 165, "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.", "slug": "django-unchained-2012", "mpa_rating": "R"}, {"rating": 8.5, "genres": ["Comedy", "Drama"], "language": "English", "title": "The Great Dictator", "url": "https://yts.to/movie/the-great-dictator-1940", "title_long": "The Great Dictator (1940)", "imdb_code": "tt0032553", "id": 271, "state": "ok", "year": 1940, "runtime": 125, "overview": "Chaplin plays two totally opposite roles in his first \"talkie,\" giving a superb display of his boundless talent for both inspired comedy and powerful drama. One of his masterfully drawn characters is a Jewish barber facing the constant threat of storm troopers and religious persecution. The other is the great dictator, Hynkel, a brilliant lampoon of Adolph Hitler that is awesome proof of Chaplin's pantomime genius. The movie's famous highlight comes in its final scene, when Chaplin steps out of character and addresses the camera with an eloquent plea for the triumph of reason and humanity over mindless militarism.", "slug": "the-great-dictator-1940", "mpa_rating": "Approved"}], "page_number": 4}, "status_message": "Query was successful"}